app/Controllers/DashboardController.php

SELECT *
FROM `users`
WHERE `username` = 'user'
 LIMIT 1
---
    public function profile_user()
    {
        $data = [
            'title' => 'My Profile',
            'user' => $this->m_User->where('username', session()->get('username'))->first(),
        ];

SELECT *
FROM `users`
WHERE `username` = 'user'
 LIMIT 1
---
    public function edit_data($id)
    {
        $data = [
            'title' => 'Edit Data',
            'user' => $this->m_User->where('username', session()->get('username'))->first(),
            'data' => $this->m_DataDBD->find($id),
            'modelKelurahan' => $this->m_Kelurahan,
        ];

SELECT *
FROM `users`
WHERE `username` = 'user'
 LIMIT 1
SELECT *
FROM `data_dbd`
WHERE `id_tahun` = 4
---
    public function identifikasi_user()
    {
        $lastClusterInserted = $this->m_ClusterDBD->getOrderById()
            ->limit(1)
            ->get()
            ->getRow();

        $data = [
            'title' => 'Identifikasi',
            'user' => $this->m_User->where('username', session()->get('username'))->first(),
            'data' => $this->m_DataDBD->where('id_tahun', 4)->findAll(),

SELECT *
FROM `users`
WHERE `username` = 'user'
 LIMIT 1
---
    public function peta_sebaran_user()
    {
        $lat_c1 = session()->get('lat_c1');
        $long_c1 = session()->get('long_c1');
        $lat_c2 = session()->get('lat_c2');
        $long_c2 = session()->get('long_c2');
        $lat_c3 = session()->get('lat_c3');
        $long_c3 = session()->get('long_c3');

        $data = [
            'title' => 'peta sebaran',
            'user' => $this->m_User->where('username', session()->get('username'))->first(),