app/Controllers/DashboardControllerAdmin.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function profile_admin()
    {
        $data = [
            'title' => 'My profile admin',
            'user' => $this->m_User->where('username', session()->get('username'))->first(),
        ];

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function edit_data_admin($id)
    {
        $data = [
            'title' => 'Edit Data',
            'user' => $this->m_User->where('username', session()->get('username'))->first(),
            'data' => $this->m_User->find($id),
        ];

UPDATE `kecamatan` SET `nama_kecamatan` = 'Mataa'
WHERE `kecamatan`.`id_kecamatan` IN ('3')
---
    public function proses_edit_data_kecamatan()
    {
        $id = $this->request->getPost('id_kecamatan');
        $data = [
            'nama_kecamatan' => $this->request->getPost('nama_kecamatan'),
        ];
        $this->m_Kecamatan->update($id, $data);

SELECT *
FROM `puskesmas`
SELECT *
FROM `kecamatan`
---
    public function data_kelurahan()
    {
        $data = [
            'title' => 'Data Kelurahan',
            'data' => $this->m_Kelurahan->findAll(),
            'modelKecamatan' => $this->m_Kecamatan,
            'modelPuskesmas' => $this->m_Puskesmas,
        ];

SELECT *
FROM `kecamatan`
SELECT *
FROM `puskesmas`
---
    public function add_kelurahan()
    {
        $data = [
            'title' => 'add kelurahan',
            'kecamatan' => $this->m_Kecamatan->findAll(),
            'puskesmas' => $this->m_Puskesmas->findAll(),

INSERT INTO `kelurahan` (`nama_kelurahan`, `id_kecamatan`, `id_puskesmas`) VALUES ('Mangga Dua', '1', '1')
---
                'id_puskesmas' => $this->request->getPost('puskesmas'),
            ];

            $this->m_Kelurahan->insert($data);

INSERT INTO `geo_location_file` (`file_name`) VALUES ('1709304609_b1b73f35d0c4fe5bf643.txt')
---
                'file_name' => $file_name,
            ];

            $this->m_GeoLocationFile->insert($data_save);

SELECT *
FROM `tahun`
---
    public function data_tahun()
    {
        $data = [
            'title' => 'Data Tahun',
            'data' => $this->m_Tahun->findAll(),
        ];

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
SELECT *
FROM `data`
SELECT *
FROM `cluster`
 LIMIT 1
---
    public function hasil_cluster()
    {
        $data = [
            'title' => 'Identifikasi',
            'user' => $this->m_User->where('username', session()->get('username'))->first(),
            'data' => $this->m_Data->findAll(),
            'cluster' => $this->m_Cluster->first(),