app/Controllers/DashboardControllerAdmin.php

SELECT *
FROM `users`
WHERE `usertype` = 'user'
---
    public function data_pengguna()
    {
        $data = [
            'title' => 'Data Pengguna',
            'user' => $this->m_User->where('username', session()->get('username'))->first(),
            'data' => $this->m_User->where('usertype', 'user')->findAll(),

SELECT *
FROM `kecamatan`
---
    public function data_kecamatan()
    {
        $data = [
            'title' => 'Data Kecamatan',
            // 'user' => $this->m_User->where('username', session()->get('username'))->first(),
            'data' => $this->m_Kecamatan->findAll(),