app/Controllers/HomeController.php

    public function proses_login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $this->m_User->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'user'
 LIMIT 1