app/Models/m_IdentificationHistoryCluster.php

SELECT *
FROM `identification_history_cluster`
WHERE `id_identification_history` = '6'
---
    public function getByIdIdentificationHistory($id_identification_history)
    {
        $data = $this->where('id_identification_history', $id_identification_history)->findAll();