app/Models/m_Kelurahan.php

    public function getNamaKelurahanById($id_kelurahan)
    {
        $kelurahan = $this->find($id_kelurahan);
---
SELECT *
FROM `kelurahan`
WHERE `kelurahan`.`id_kelurahan` = '5'